Revit 2024 API
ParameterTypeId.StructuralAnalyticalProjectFloorPlane Property
 "Vertical Projection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralAnalyticalProjectFloorPlane { get; }
Visual Basic
Public Shared ReadOnly Property StructuralAnalyticalProjectFloorPlane As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralAnalyticalProjectFloorPlane {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace